{
  "name": "Вадим Гамоля",
  "experience": "Опыт работы",
  "education": "Образование",
  "tagline": "(33) • Разработчик игр • Unity",
  "nav": {
    "summary": "Резюме",
    "skills": "Навыки",
    "experience": "Опыт",
    "projects": "Проекты",
    "education": "Образование",
    "languages": "Языки",
    "contact": "Контакты"
  },
  "cards": {
    "skills": {
      "programming": {
        "title": "Программирование",
        "text": "C#, Python, JavaScript, TypeScript, ShaderGraph / HLSL"
      },
      "engines": {
        "title": "Движки",
        "text": "Unity (4+ лет), Godot, Cocos"
      },
      "systems": {
        "title": "Системы и фокус",
        "text": "Архитектура игрового процесса, оптимизация всех аспектов игры, детерминированная логика, интеграция физики, системы сохранения, пайплайны сборки билдов."
      },
      "tools": {
        "title": "Инструменты",
        "text": "UniRx(R3), UniTask, Odin, FacePunch, Mirror Networking, DotTween, PrimeTween, Zenject, VContainer, Addressables, ECS frameworks, Master Audio, EasySave, GamePush, Git, GitLab Actions, GitHub Actions"
      },
      "graphics": {
        "title": "Графика / Технологии",
        "text": "Рендер-пайплайны (URP/HDRP), профилирование GPU, батчинг, написание шейдеров, VFX Graph, профилирование и оптимизация рендеринга."
      },
      "soft": {
        "title": "Soft Skills",
        "text": "Умение находить общий язык и выстраивать доверительные отношения. Ответственность за результат и готовность брать инициативу. Навык активного слушания и понимания собеседника. Спокойствие и выдержка в стрессовых ситуациях. Командное взаимодействие и поддержка коллег. Гибкость мышления и умение адаптироваться к изменениям."
      }
    },
    "projects": {
      "p1": {
        "title": "Grimdark",
        "text": "Крупный проект с целевыми платформами WebGL и PC. Множество кастомных инструментов и решений для поддержания производительности на необычном наборе платформ и с учетом требований игры. Полный цикл разработки от концепции до релиза, включая многочисленные прототипы механик. Общение с игроками, сбор отзывов и решение проблем. Расчет баланса. Создание нового контента. Полная поддержка проекта с самого начала."
      },
      "p2": {
        "title": "Hyper casual",
        "text": "Набор гиперказуальных игр с простыми механиками и быстрой играбельностью. Множественные быстрые итерации по улучшению и изменению игрового процесса. Создание переиспользуемого контента и инструментов для ускорения разработки."
      },
      "p3": {
        "title": "Among Us для инфлюенсеров",
        "text": "Создание мультиплеерного проекта, похожего на Among Us, с уникальными механиками для стримеров в кратчайшие сроки.",
        "unreleased": "Не выпущено"
      }
    }
  },
  "sections": {
    "summary": {
      "title": "Резюме",
      "subtitle": "Обзор"
    },
    "skills": {
      "title": "Основные навыки",
      "subtitle": "Стек"
    },
    "experience": {
      "title": "Опыт работы",
      "subtitle": "Роли"
    },
    "projects": {
      "title": "Проекты",
      "subtitle": "Выпущенные и прототипы"
    },
    "education": {
      "title": "Образование",
      "subtitle": "Академическое"
    },
    "languages": {
      "title": "Языки",
      "subtitle": "Уровень владения"
    },
    "contact": {
      "title": "Контакты",
      "subtitle": "Связаться"
    }
  },
  "content": {
    "summary_text": "Независимый / фриланс разработчик игр с 4+ годами коммерческого опыта. Работал как над небольшими игровыми проектами, прототипированием и гиперказуальными играми, так и над крупным проектом. Участвовал в полном цикле разработки — от идеи до релиза и сопровождения всех аспектов игры, включая поддержку нескольких платформ. Занимался оптимизацией производительности и рабочих процессов. Оптимизировал CPU, GPU, память и размер игры для разных платформ. Сторонник использования инструментов и времени по назначению, без изобретения «велосипеда» ради мелких фич. Ставлю приоритет на умение адаптироваться и обучаться для решения конкретных задач максимально быстрым и продуктивным способом. Люблю учиться новому и делиться знаниями с командой. По максимуму использую ИИ для ускорения рабочих процессов. Эмпатичен, умею слушать, легко подключаюсь к обсуждению как технических, так и дизайнерских вопросов.",
    "contact_intro": "Открыт для контрактных / full-time возможностей (удаленно). Предпочитаю роли, сосредоточенные на игровых механиках, создании инструментов и оптимизации производительности.",
    "back_to_top": "Наверх ↑",
    "key_strengths": {
      "gameplay_systems": "Игровые механики",
      "tools_pipelines": "Инструментарий",
      "optimization": "Оптимизация",
      "technical_design": "Архитектурное проектирование",
      "learning_ability": "Обучаемость"
    },
    "experience": {
      "role1": "Ведущий программист игрового процесса – Инди-студия / Фриланс",
      "date1": "2022 – Настоящее время",
      "desc1": "Создание проекта с нуля, целевые платформы – WebGL, PC. Собственная легковесная система (основанная на небольшом количестве типов игровых объектов, из которых воссоздаются все элементы игры), поддерживающая большое количество объектов на экране для PC и мобильных устройств. Самописная система инструментов для проектирования сложных способностей. Кастомная система компонентов для ускорения игровых процессов. Поддержка облачных сохранений. Создание и итерационное улучшение игровых механик с нуля. Работа с отзывами и проблемами пользователей. Строго структурированная система передачи данных от механик в UI. Самописная система вложенных характеристик. Процедурная система баланса и спавна противников. Поддержка локализации. Расчет баланса, описание игровых механик, создание и проработка нового контента.",
      "role3": "Младший разработчик игр – HiTyara / Фриланс / Проектное сотрудничество",
      "date3": "2021 – 2022",
      "desc3": "Быстрое прототипирование. Сопровождение проектов. Работа с издателем гиперказуальных игр.",
      "role4": "Разработка проектов в команде энтузиастов",
      "date4": "2021",
      "desc4": "Создание мультиплеерной игры с нуля, включая проектирование архитектуры, реализацию сетевого кода и создание инструментов для дизайнеров.",
      "role5": "Работы, не связанные или слабо связанные с IT",
      "date5": "2014 – 2018",
      "desc5": "Работа в различных сферах, не связанных с информационными технологиями. Менеджмент проектов. Работа с бизнес-клиентами. Оптимизация рабочих процессов."
    },
    "education": {
      "degree1": "Бакалавр / Системы автоматизированного проектирования / Программная инженерия – МАМИ",
      "date1": "2011 – 2015",
      "desc1": "Фокус: проектирование и моделирование с помощью инструментов автоматизированного проектирования.",
      "degree2": "Специалист / Автоматизированные системы управления – МПТ",
      "date2": "2007 – 2011",
      "desc2": "Фокус: автоматизация, управление процессами, системы реального времени."
    },
    "languages": {
      "russian": "Русский",
      "russian_level": "Носитель языка",
      "english": "Английский",
      "english_level": "B1-B2"
    }
  },
  "footer": {
    "copyright": "© {year} DrySprout. Эта страница представляет собой резюме в одном файле (HTML + CSS + JSON-LD). Подходит для печати и доступна."
  },
  "meta": {
    "age": "(33)"
  }
}
